Show / Hide Table of Contents
Class SubStructureGeometry
SubStructureGeometry
Inheritance
System.Object
OpenObject
SubStructureGeometry
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.SubStructureGeometry, CI.StructuralElements", "CI.StructModel.Structure.ISubStructureGeometry,CI.BasicTypes")]
public class SubStructureGeometry : OpenObject
Constructors
Improve this Doc   View Source
SubStructureGeometry()
Constructor
Declaration
public SubStructureGeometry()
Properties
Improve this Doc   View Source
ConnectionPoints
Array of connection points
Declaration
public List<ReferenceElement> ConnectionPoints { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
List of ConnectionPoints
Improve this Doc   View Source
RealMembers
Array of DesignMemberInSubStructure
Declaration
public List<DesignMemberInSubStructure> RealMembers { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<DesignMemberInSubStructure>
List of DesignMemberInSubStructure
Improve this Doc   View Source
TheoreticalMembers
Array of DesignMemberInSubStructure
Declaration
public List<DesignMemberInSubStructure> TheoreticalMembers { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<DesignMemberInSubStructure>
List of DesignMemberInSubStructure
 Improve this Doc
 View Source